app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2015-12-31 21:17:16.238910"], ["id", 3]]
---
	def update
	  @post = Post.find(params[:id])
	#   the code below does not allow for updating the changes, unpermitted paramaters
	#   @post.update(title: params[:title], description: params[:description])
	#   let's change it and require the permission
	  @post.update(params.require(:post).permit(:title, :description))